import {
  IonPage,
  IonHeader,
  IonToolbar,
  IonButtons,
  IonBackButton,
  IonTitle,
  IonContent,
  IonTextarea,
  IonButton
} from "@ionic/react";
import { useParams, useHistory } from "react-router-dom";
import "./ReflectionAnswer.css";
import { useState } from "react";

const categoryMap: any = {
  self: {
    questions: [
      "วันนี้คุณคิดกับตัวเองยังไง?",
      "ตอนนี้คุณกังวลเรื่องอะไรมากที่สุด?",
      "มีอะไรที่คุณกดดันตัวเองไหม?",
      "ช่วงนี้คุณพอใจกับตัวเองแค่ไหน?",
      "ถ้าย้อนกลับไปได้ คุณอยากบอกอะไรกับตัวเองในตอนนี้?",
      "วันนี้คุณภูมิใจในตัวเองเรื่องอะไร?",
      "วันนี้คุณดูแลตัวเองดีแค่ไหน?",
      "มีอะไรที่คุณอยากให้อภัยตัวเองไหม?",
      "วันนี้คุณได้พักผ่อนเพียงพอหรือยัง?",
      "มีอะไรที่คุณอยากปรับปรุงในตัวเองบ้าง?",
      "คุณมักจะทำอะไรเวลาเศร้า เหงา เปล่าเปลี่ยว เดียวดาย?",
      "คุณร้องไห้ล่าสุดเมื่อไหร่ เพราะอะไร เล่าได้ไหม?",
      "ช่วงนี้คุณได้ทำสิ่งที่คุณรักหรือเปล่า แล้วช่วงนี้คุณรักอะไรนะ?",
      "7 วันต่อจากนี้คุณมีอะไรที่อยากทำเป็นพิเศษไหม?",
      "คุณมีบัคเก็ตลิสต์ (Bucket List) หรือยัง อยากรู้จังบอกได้ไหม?",
      "คุณมีค่านิยมประจำใจไหม?",
      "ถ้าโลกจะจบสิ้นในอีก 7 วัน คุณจะทำอย่างไร?"
    ]
  },

  daily: {
    questions: [
      "วันนี้เกิดอะไรขึ้นบ้าง?",
      "ช่วงไหนของวันคุณรู้สึกดีที่สุด?",
      "มีช่วงไหนของวันที่ทำให้คุณเครียด?",
      "วันนี้มีเรื่องอะไรที่ทำให้คุณยิ้มได้?",
      "วันนี้คุณได้ลองทำอะไรใหม่ ๆ ไหม?",
      "วันนี้มีเหตุการณ์อะไรที่คุณอยากจำไว้?",
      "วันนี้คุณใช้เวลากับอะไรเป็นส่วนใหญ่?",
      "มีช่วงไหนของวันนี้ที่คุณรู้สึกเหนื่อยที่สุด?",
      "ถ้าต้องให้คะแนนวันนี้ คุณจะให้กี่คะแนน?",
      "วันนี้คุณได้เรียนรู้อะไรบ้าง?",
      "วันนี้มีสิ่งไหนที่ช่วยเยียวยาใจคุณบ้างไหม?",
      "เหนื่อยไหมวันนี้?",
      "ช่วงนี้มีเพลงที่ชอบฟัง หนังที่ชอบดู หนังสือที่ชอบอ่าน สถานที่ชอบที่ชอบไหม?",
      "ช่วงนี้คุณชอบกินอะไรเป็นพิเศษไหม?",
      "เมนูไหนที่คิดถึง?",
      "สิ่งใดที่ช่วงระยะเวลาหนึ่งในชีวิตที่คุณชอบมาก แต่ตอนนี้ไม่มีสิ่งนั้นแล้ว?"

    ]
  },

  work: {
    questions: [
      "วันนี้งาน/เรียนเป็นยังไงบ้าง?",
      "มีอะไรที่ทำได้ดีวันนี้?",
      "คุณมีอะไรอยากบอกเกี่ยวกับเรื่องงาน/เรียนไหม?",
      "อยากให้คุณนึกถึงวันแรกที่คุณเริ่มทำสิ่งนี้ วันที่เหลือคุณอยากทำอะไร?",
      "มีอะไรที่ท้าทายหรือยากสำหรับคุณ?",
      "วันนี้คุณรู้สึกกดดันกับงานหรือการเรียนไหม?",
      "วันนี้คุณได้เรียนรู้อะไรใหม่ ๆ จากงานหรือการเรียนหรือเปล่า?",
      "มีอะไรที่คุณอยากทำให้ดีขึ้นในวันพรุ่งนี้?",
      "มีงานไหนที่คุณภูมิใจในวันนี้?",
      "วันนี้คุณจัดการเวลางานได้ดีไหม?"
    ]
  },

  relation: {
    questions: [
      "ช่วงนี้ความสัมพันธ์กับคนรอบตัวเป็นยังไง?",
      "วันนี้คุณได้พูดคุยกับใครบ้าง?",
      "มีใครทำให้คุณรู้สึกดีวันนี้ไหม?",
      "มีใครทำให้คุณรู้สึกไม่สบายใจไหม?",
      "วันนี้คุณได้แสดงความห่วงใยต่อใครบ้าง?",
      "คุณอยากขอบคุณใครเป็นพิเศษไหม?",
      "มีอะไรที่คุณอยากพูดกับใครแต่ยังไม่ได้พูดไหม?",
      "วันนี้คุณรู้สึกใกล้ชิดกับใครมากที่สุด?",
      "คุณละเลยใครบ้างหรือเปล่า? (อย่าลืมนับตัวเองด้วยนะ)",
      "คุณหลงลืมอะไรบางอย่างไปบ้างหรือเปล่า?",
      "ในความสัมพันธ์นี้คุณกลัวอะไรที่สุด?"    
    ]
  },

  life: {
    questions: [
      "ตอนนี้ชีวิตคุณกำลังไปทางไหน?",
      "คุณพอใจกับชีวิตตอนนี้แค่ไหน?",
      "มีเป้าหมายอะไรที่คุณกำลังพยายามทำอยู่?",
      "มีอะไรที่คุณอยากเปลี่ยนแปลงในชีวิต?",
      "อะไรคือสิ่งสำคัญที่สุดสำหรับคุณตอนนี้?",
      "คุณอยากเห็นตัวเองเป็นแบบไหนในอนาคต?",
      "มีอะไรที่ทำให้คุณรู้สึกมีความหมายในชีวิต?",
      "ตอนนี้คุณกำลังเติบโตในด้านไหน?",
      "ช่วงนี้คุณได้ทำสิ่งที่ชอบบ้างไหม?",
      "คุณคิดว่าตัวเองตอนอายุ 70 ปี จะเป็นอย่างไร?",
      "เดินทางมาจนถึงตอนนี้ คุณมีหนังสือ ละคร เพลง คำพูด หรืออะไรก็ตามที่ทำให้คุณเปลี่ยนความคิดบ้างไหม?",
      "ว่ากันว่าความคิดคนเราจะเปลี่ยนทุก ๆ 7 ปี แล้วความคิดคุณตอนนี้กับ 7 ปีที่แล้วต่างกันมากน้อยแค่ไหน อย่างไร? แล้วคุณคิดว่าอีก 7 ปีข้างหน้าคุณจะยังเหมือนเดิมอยู่หรือเปล่า?",
      "มีเพลงไหนที่ฟังทีไรก็น้ำตาซึมทุกทีไหม?",
      "คุณว่านอกดาวเคราะห์สีน้ำเงินในระบบสุริยะจักรวาลดวงนี้ที่คุณเหยียบอยู่ มีสิ่งมีชีวิตอื่นอยู่ไหม แล้วคุณว่าชีวิตคืออะไร?",
      "วันนี้มืดพรุ่งนี้สว่าง แล้วคุณเคยมีวันที่แสงสว่างขาดหายไปไหม?",
      "คุณเคยอยากทำทุกอย่าง ยกเว้นสิ่งที่คุณเคยชอบมาก ๆ ไหม? แล้วตอนนี้คุณยังอยากทำมันอยู่หรือเปล่า?",
      "ถ้านี่เป็นเพียงฝัน คุณอยากตื่นไหม?"
    ]
  },

  gratitude: {
    questions: [
      "วันนี้คุณรู้สึกขอบคุณอะไร?",
      "วันนี้มีเรื่องเล็ก ๆ อะไรที่ทำให้คุณมีความสุข?",
      "มีใครที่คุณอยากขอบคุณไหม?",
      "มีเหตุการณ์ดี ๆ อะไรเกิดขึ้นวันนี้?",
      "วันนี้มีอะไรที่ทำให้คุณยิ้มได้?",
      "มีอะไรที่คุณมองข้ามไปแต่จริง ๆ แล้วดีมาก?",
      "มีสิ่งดี ๆ ในชีวิตที่คุณอยากจดจำไหม?",
      "วันนี้คุณได้ช่วยเหลือใครหรือเปล่า?"
    ]
  }
};

const ReflectionAnswer: React.FC = () => {
  const { category, index } = useParams<{ category: string; index: string }>();
  const history = useHistory();
  const question = categoryMap[category]?.questions[Number(index)];
  const [answer, setAnswer] = useState("");

  const saveAnswer = () => {
    const old = JSON.parse(localStorage.getItem("reflectionHistory") || "[]");

    const newItem = {
      id: Date.now(),
      category,
      question,
      answer,
      date: new Date().toISOString()
    };

    localStorage.setItem(
      "reflectionHistory",
      JSON.stringify([newItem, ...old])
    );

    history.push("/tabs/reflection/history");
  };

  return (
    <IonPage>
      <IonHeader>
        <IonToolbar>
        <IonButtons slot="start">
            <IonBackButton defaultHref={`/tabs/reflection/${category}`} text="กลับ" />
        </IonButtons>
        <IonTitle className="center-title">ตอบคำถาม</IonTitle>
        <br />
        </IonToolbar>
    </IonHeader>

    <IonContent fullscreen className="answer-page">
        <div className="answer-wrapper">
            <div className="answer-card">
            <p className="answer-question">{question}</p>

            <IonTextarea
                placeholder="คำตอบของคุณ..."
                value={answer}
                onIonChange={(e) => setAnswer(e.detail.value!)}
                autoGrow/>
            <div className="answer-footer">
                <IonButton size="small" onClick={saveAnswer}>บันทึกคำตอบ</IonButton>
            </div>
            </div>
        </div>
    </IonContent>

    </IonPage>
  );
};

export default ReflectionAnswer;
